Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/SUI_РабочееМестоОператораОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_РабочееМестоОператораОбмена</name>
</mdclass:DataProcessor>

Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/Forms/Форма/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов(Справочники.SUI_НастройкиДокументовОбмена.ПолучитьНастроенныеТипы());
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ДокументыОбмена.КоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "ДокументыОбменаПодключаемыеКоманды_";
	
	Если ПараметрыРазмещения.Источники.Типы().Количество() > 0 Тогда
		
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
		
		Для Каждого ПодчиненныйЭлементКПСписка Из Элементы.ДокументыОбмена.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			
			Если ПодчиненныйЭлементКПСписка.Вид <> ВидГруппыФормы.Подменю Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПодчиненныйЭлементКПСписка.Имя <> "ДокументыОбменаПодключаемыеКоманды_ПодменюПечать" И 
				ПодчиненныйЭлементКПСписка.Имя <> "ДокументыОбменаПодключаемыеКоманды_ПодменюОтчеты" И 
				ПодчиненныйЭлементКПСписка.Имя <> "ДокументыОбменаПодключаемыеКоманды_ПодменюСоздатьНаОсновании" И
				ПодчиненныйЭлементКПСписка.Имя <> "ДокументыОбменаПодключаемыеКоманды_SUI_ПодменюSimple" Тогда
				ПодчиненныйЭлементКПСписка.Видимость = Ложь;
			КонецЕсли;
			
			Если ПодчиненныйЭлементКПСписка.Имя = "ДокументыОбменаПодключаемыеКоманды_SUI_ПодменюSimple" Тогда
				ПодчиненныйЭлементКПСписка.Заголовок = СтрШаблон(НСтр("ru = '%1: Документ основание'"), SUI_SimpleКлиентСервер.Представление());
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// СтандартныеПодсистемы.ПодключаемыеКоманды <<<
	
	ДатаОтсутствияСеанса = ТекущаяДатаСеанса() - SUI_МобильныеУстройстваСервер.СрокДействительностиСеансаВСекундах();
	SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(МобильныеУстройства.КомпоновщикНастроек, "ДатаОтсутствияСеанса", ДатаОтсутствияСеанса);
	
	// Отобразить QR код для скачивания мобильного приложения
	ДанныеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения(), 0, 130);
	QRКодСкачатьПриложение = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SUI_ПринятЗапросАвторизации" Тогда
		Элементы.МобильныеУстройства.Обновить();
		Элементы.ЗапросыАвторизации.Обновить();
	ИначеЕсли ИмяСобытия = "SUI_ОтклоненЗапросАвторизации" Тогда
		Элементы.ЗапросыАвторизации.Обновить();
	ИначеЕсли ИмяСобытия = "SUI_СозданЗапросПолнойВыгрузки" Тогда
		Элементы.МобильныеУстройства.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументыОбменаОтборНастройкиПриИзменении(Элемент)
	УстановитьОтборДокументовОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОбменаОтборСостоянияПриИзменении(Элемент)
	УстановитьОтборДокументовОбмена();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыДокументОбменаСодержаниеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	УстановитьОтборВСодержимомДокументаОбмена();
КонецПроцедуры

&НаКлиенте
Процедура QRКодСкачатьПриложениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("QRКодСкачатьПриложениеНажатиеПодтверждение", ЭтотОбъект);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Перейти на сайт для скачивания приложения %1?'"), SUI_SimpleКлиентСервер.Представление());
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОбмена

&НаСервереБезКонтекста
Процедура ДокументыОбменаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		СтрокаСписка.Значение.Данные.Ссылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
			СтрокаСписка.Значение.Данные.ДокументОснование, Истина);
		СтрокаСписка.Значение.Данные.ДокументОснованиеПредставление = Строка(СтрокаСписка.Значение.Данные.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОбменаПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды <<<
	
	Элементы.ГруппаДокументыОбменаСодержание.Видимость = (Элементы.ДокументыОбмена.ТекущиеДанные <> Неопределено);
	Если Элементы.ГруппаДокументыОбменаСодержание.Видимость Тогда
		Элементы.ГруппаДокументыОбменаСодержание.Заголовок = Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена;
		УстановитьОтборВСодержимомДокументаОбмена();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументыОбменаПриОбновленииСоставаПользовательскихНастроекНаСервере(Элемент, СтандартнаяОбработка)
	
	РеквизитыОтбора = Новый Структура();
	РеквизитыОтбора.Вставить("НастройкаДокумента", ДокументыОбменаОтборНастройки);
	РеквизитыОтбора.Вставить("Состояние", ДокументыОбменаОтборСостояния);
	
	ОбновитьРеквизитыОтбораДокументовОбмена(ДокументыОбмена.КомпоновщикНастроек.ПользовательскиеНастройки, РеквизитыОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ДокументыОбменаПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	РеквизитыОтбора = Новый Структура();
	РеквизитыОтбора.Вставить("НастройкаДокумента", ДокументыОбменаОтборНастройки);
	РеквизитыОтбора.Вставить("Состояние", ДокументыОбменаОтборСостояния);
	
	ОбновитьРеквизитыОтбораДокументовОбмена(ДокументыОбмена.КомпоновщикНастроек.ПользовательскиеНастройки, РеквизитыОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ДокументыОбмена);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ДокументыОбмена, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ДокументыОбмена);
КонецПроцедуры
// СтандартныеПодсистемы.ПодключаемыеКоманды <<<

&НаКлиенте
Процедура ВыгрузитьНовыйДокумент(Команда)
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("РежимВыбора",	Истина);
    ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", Новый НастройкиКомпоновкиДанных());
	
    SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ПараметрыВыбора.ФиксированныеНастройки, "Используется", Истина);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ПараметрыВыбора.ФиксированныеНастройки, "ПометкаУдаления", Ложь);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНовыйДокументЗавершениеВыбораНастройки", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.SUI_НастройкиДокументовОбмена.ФормаВыбора", ПараметрыВыбора, ЭтотОбъект, УникальныйИдентификатор, , , 
		ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроверкуДокументаОбмена(Команда)
	
	Если Элементы.ДокументыОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.ОткрытьФормуПроверкиДокументаОбмена(Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена, 
		ЭтотОбъект, УникальныйИдентификатор, , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИдентификаторДокументаОбмена(Команда)
	
	Если Элементы.ДокументыОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.ПоказатьИдентификаторДокументаОбмена(Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокументОбменаКВыгрузке(Команда)
	
	Если Элементы.ДокументыОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.ЗарегистрироватьДокументОбменаКВыгрузке(Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена, 
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросАвторизацииПринять(Команда)
	
	Если Элементы.ЗапросыАвторизации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ПринятьЗапросАвторизации(Элементы.ЗапросыАвторизации.ТекущиеДанные.ID);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросАвторизацииОтклонить(Команда)
	
	Если Элементы.ЗапросыАвторизации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ОтклонитьЗапросАвторизации(Элементы.ЗапросыАвторизации.ТекущиеДанные.ID);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОфлайнОбмен(Команда)
	
	ОткрытьФорму("Обработка.SUI_РабочееМестоОператораОбмена.Форма.ОбменСПользователямиОфлайн", , ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОтборДокументовОбмена()
	
	ПараметрыУстановкиОтбора = Новый Структура();
	ПараметрыУстановкиОтбора.Вставить("ВПользовательскиеНастройки", Истина);
	ПараметрыУстановкиОтбора.Вставить("ЗаменятьСуществующий", Истина);
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ДокументыОбмена.КомпоновщикНастроек, "НастройкаДокумента", 
		ДокументыОбменаОтборНастройки, ВидСравненияКомпоновкиДанных.ВСписке, ЗначениеЗаполнено(ДокументыОбменаОтборНастройки),
		ПараметрыУстановкиОтбора);
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ДокументыОбмена.КомпоновщикНастроек, "Состояние", 
		ДокументыОбменаОтборСостояния, ВидСравненияКомпоновкиДанных.ВСписке, ЗначениеЗаполнено(ДокументыОбменаОтборСостояния),
		ПараметрыУстановкиОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьРеквизитыОтбораДокументовОбмена(Настройки, РеквизитыОтбора)
	
	РеквизитыОтбора.НастройкаДокумента.Очистить();
	РеквизитыОтбора.Состояние.Очистить();
	
	Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ОтборКомпоновкиДанных") Тогда
			
			Для Каждого ЭлементОтбора Из ЭлементНастройки.Элементы Цикл
				
				Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НастройкаДокумента") Тогда
					ТекущийРеквизит = РеквизитыОтбора.НастройкаДокумента;
				ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние") Тогда
					ТекущийРеквизит = РеквизитыОтбора.Состояние;
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
					ТекущийРеквизит.ЗагрузитьЗначения(ЭлементОтбора.ПравоеЗначение.ВыгрузитьЗначения());
				ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
					ТекущийРеквизит.Добавить(ЭлементОтбора.ПравоеЗначение);
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВСодержимомДокументаОбмена()
	
	Если Элементы.СтраницыДокументОбменаСодержание.ТекущаяСтраница = Элементы.СтраницаДокументОбменаПотокШтрихкодов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПотокШтрихкодов, "ДокументОбмена",
			Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ИначеЕсли Элементы.СтраницыДокументОбменаСодержание.ТекущаяСтраница = Элементы.СтраницаДокументОбменаПотокШтрихкодов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ГрупповойПересчет, "ДокументОбмена",
			Элементы.ДокументыОбмена.ТекущиеДанные.ДокументОбмена, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНовыйДокументЗавершениеВыбораНастройки(ВыбраннаяНастройка, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("НастройкаДокумента", ВыбраннаяНастройка);
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("РежимВыбора",	Истина);
    ПараметрыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", Новый НастройкиКомпоновкиДанных());
	
	ПараметрыОткрытияСписка = ПолучитьПараметрыОткрытияСпискаДокументовПоНастройке(Контекст.НастройкаДокумента);
	SUI_КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(ПараметрыВыбора.ФиксированныеНастройки.Отбор, 
		ПараметрыОткрытияСписка.НастройкиКомпоновкиОтбора.Отбор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНовыйДокументЗавершениеВыбораДокумента", ЭтотОбъект, Контекст);
	
	ОткрытьФорму("Документ." + ПараметрыОткрытияСписка.ИмяМетаданныхДокумента + ".ФормаВыбора", ПараметрыВыбора, 
		ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОткрытияСпискаДокументовПоНастройке(НастройкаДокумента)
	
	ПараметрыОткрытияСписка = Новый Структура("ИмяМетаданныхДокумента, НастройкиКомпоновкиОтбора");
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеИзНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаДокумента, "ИмяМетаданныхДокумента,ХранилищеНастроекОтбораДокументов");
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытияСписка, ДанныеИзНастройки);
	
	ОписаниеТипаНастройкиКомпоновки = Новый ОписаниеТипов("НастройкиКомпоновкиДанных");
	ПараметрыОткрытияСписка.НастройкиКомпоновкиОтбора = ОписаниеТипаНастройкиКомпоновки.ПривестиЗначение(
		ДанныеИзНастройки.ХранилищеНастроекОтбораДокументов.Получить());
	
	Возврат ПараметрыОткрытияСписка;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьНовыйДокументЗавершениеВыбораДокумента(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНовыйДокументЗавершение", ЭтотОбъект);
	
	Контекст = Новый Структура();
	Контекст.Вставить("ДокументСсылка", ВыбранныйДокумент);
	Контекст.Вставить("ПараметрыВыполнения", Новый Структура("Форма", ЭтотОбъект));
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументОснование", Контекст.ДокументСсылка);
	ПараметрыОткрытия.Вставить("ВыборМобильныхУстройств", Истина);
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Выгрузка в документ обмена'"));
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьВДокументОбменаЗавершениеВыбораНастроек", SUI_ДокументыОбменаКлиент, Контекст);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, 
		ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНовыйДокументЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.СозданныеДокументыОбмена.Количество() > 0 Или
		РезультатВыполнения.ОбновленныеДокументыОбмена.Количество() > 0 Тогда
		Элементы.ДокументыОбмена.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура QRКодСкачатьПриложениеНажатиеПодтверждение(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Да Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
